Repository: blinkdeveloper33/blink-app3
Catalog: lib/l10n/app_*.arb
Languages: es

# onboardingTitle1
source: Instant Cash Access
es: Acceso Instantáneo a Efectivo

# onboardingSubtitle1
source: Get BlinkAdvance cash advances from $150 to $300, no credit check required.
es: Obtén adelantos de efectivo BlinkAdvance de $150 a $300, sin verificación de crédito.

# onboardingTitle2
source: Smart Money Management
es: Gestión Inteligente del Dinero

# onboardingSubtitle2
source: Track spending, set budgets, and make informed financial decisions.
es: Rastrea gastos, establece presupuestos y toma decisiones financieras informadas.

# onboardingTitle3
source: Transparent & Fair
es: Transparente y Justo

# onboardingSubtitle3
source: No hidden fees, automatic repayment on your chosen date.
es: Sin cargos ocultos, reembolso automático en la fecha que elijas.

source: Back
es: Atrás

source: Next
es: Siguiente

source: Get Started
es: Comenzar

source: Skip
es: Saltar
